public class Main {
      /*
       Разработать приложение, позволяющее просматривать файлы и каталоги файловой системы,
       а также создавать и удалять текстовые файлы.

       Для работы с текстовыми файлами необходимо реализовать функциональность записи (дозаписи) в файл.
       Требуется определить исключения для каждого слоя приложения и корректно их обработать.
        */

    public static void main(String[] args) {

        ConsoleReader consoleReader = new ConsoleReader();
        consoleReader.Console();
    }
}
